Hi @edwardmedia,
Thanks for your help. i will give you full informations.
Tell me if you need other informations.
Regards.
# Informations
- do you want to verify the runner has right permissions?Yes, he have full access.
- Terraform version: `Terraform v0.14.10`
- resume: i have a diferent behaviour when i use google version 3.67.0 and google verison 3.63.0

# TL;DR 
- with 3.67 on terraform apply i got an error but my resource is creating well.
- with 3.67 on terraform destroy all things is ok.
- with 3.63.0 on terraform apply all things is ok.

# With google version 3.67.0
## Code
```tf
terraform {
  required_version = ">= 0.13"
  required_providers {
    google = {
      source  = "hashicorp/google"
      version = "3.67.0"
    }
  }
}

provider "google" {
  alias   = "lh"
  project = "lh"
}

provider "google" {
  project = "prod"
  region  = "europe-west1"
  zone    = "europe-west1-b"
}

data "google_dns_managed_zone" "prod_public" {
  provider = google.lh
  name     = "lh-zone"
}

resource "google_dns_record_set" "jenkins_hostname" {
    provider = google.lh
  name     = "jenkins.${data.google_dns_managed_zone.prod_public.dns_name}"
  type     = "A"
  ttl      = 300

  managed_zone = data.google_dns_managed_zone.prod_public.name

  rrdatas = [google_compute_global_address.jenkins_ip.address]
}

resource "google_compute_global_address" "jenkins_ip" {
  name        = "global-jenkins-ip"
  description = "Generated by Terraform"
}
```
## 0 - Terraform init
`terraform init -upgrade`
## 1 - Terraform plan
`terraform plan`:
```sh
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_global_address.jenkins_ip will be created
  + resource "google_compute_global_address" "jenkins_ip" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + description        = "Generated by Terraform"
      + id                 = (known after apply)
      + name               = "global-jenkins-ip"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # google_dns_record_set.jenkins_hostname will be created
  + resource "google_dns_record_set" "jenkins_hostname" {
      + id           = (known after apply)
      + managed_zone = "lh-zone"
      + name         = "jenkins.lh.cloud."
      + project      = (known after apply)
      + rrdatas      = [
          + (known after apply),
        ]
      + ttl          = 300
      + type         = "A"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
## 2 - Check ressource before terraform apply
` gcloud dns record-sets list --project=lh --zone=lh-zone`:
```sh
NAME                                                        TYPE  TTL    DATA
```
We can see i have no recors sets here
## 3 - Terraform Apply:
`terraform apply -auto-approve`:
```sh
google_compute_global_address.jenkins_ip: Creating...
google_compute_global_address.jenkins_ip: Still creating... [10s elapsed]
google_compute_global_address.jenkins_ip: Creation complete after 12s [id=projects/prod/global/addresses/global-jenkins-ip]
google_dns_record_set.jenkins_hostname: Creating...

Error: Error when reading or editing DNSResourceDnsRecordSet "projects/lh/managedZones/lh-zone/rrsets/jenkins.lh.cloud./A": googleapi: Error 403: Forbidden, forbidden

  on main.tf line 16, in resource "google_dns_record_set" "jenkins_hostname":
  16: resource "google_dns_record_set" "jenkins_hostname" {

```
## 4 - Check Ressources After Terraform apply
` gcloud dns record-sets list --project=lh --zone=lh-zone`:
```
NAME                                                        TYPE  TTL    DATA
jenkins.lh.cloud.                            A     300    35.186.255.87
```
After terraform apply i got an error during processing but my resource is creating well.
## 5 - Terraform Destroy
`terraform destroy -auto-approve`:
```
google_dns_record_set.jenkins_hostname: Destroying... [id=projects/lh/managedZones/lh-zone/rrsets/jenkins.lh.cloud./A]
google_dns_record_set.jenkins_hostname: Destruction complete after 1s
google_compute_global_address.jenkins_ip: Destroying... [id=projects/prod/global/addresses/global-jenkins-ip]
google_compute_global_address.jenkins_ip: Still destroying... [id=projects/prod/global/addresses/global-jenkins-ip, 10s elapsed]
google_compute_global_address.jenkins_ip: Destruction complete after 12s

Destroy complete! Resources: 2 destroyed.
```
## 6 - Check Ressources After Terraform destroy
`gcloud dns record-sets list --project=lh --zone=lh-zone`:
```
NAME                                                        TYPE  TTL    DATA
```
After terraform destory my records set is deleting well.
# With google version 3.63.0
## Code
```tf
terraform {
  required_version = ">= 0.13"
  required_providers {
    google = {
      source  = "hashicorp/google"
      version = "3.63.0"
    }
  }
}

provider "google" {
  alias   = "lh"
  project = "lh"
}

provider "google" {
  project = "prod"
  region  = "europe-west1"
  zone    = "europe-west1-b"
}

data "google_dns_managed_zone" "prod_public" {
  provider = google.lh
  name     = "lh-zone"
}

resource "google_dns_record_set" "jenkins_hostname" {
    provider = google.lh
  name     = "jenkins.${data.google_dns_managed_zone.prod_public.dns_name}"
  type     = "A"
  ttl      = 300

  managed_zone = data.google_dns_managed_zone.prod_public.name

  rrdatas = [google_compute_global_address.jenkins_ip.address]
}

resource "google_compute_global_address" "jenkins_ip" {
  name        = "global-jenkins-ip"
  description = "Generated by Terraform"
}
```
## 0 - Terraform init
`terraform init -upgrade`
## 1 - Terraform plan
`terraform plan`:
```sh
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_global_address.jenkins_ip will be created
  + resource "google_compute_global_address" "jenkins_ip" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + description        = "Generated by Terraform"
      + id                 = (known after apply)
      + name               = "global-jenkins-ip"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # google_dns_record_set.jenkins_hostname will be created
  + resource "google_dns_record_set" "jenkins_hostname" {
      + id           = (known after apply)
      + managed_zone = "lh-zone"
      + name         = "jenkins.lh.cloud."
      + project      = (known after apply)
      + rrdatas      = [
          + (known after apply),
        ]
      + ttl          = 300
      + type         = "A"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

## 2 - Check resource before terraform apply
` gcloud dns record-sets list --project=lh --zone=lh-zone`:
```sh
NAME                                                        TYPE  TTL    DATA
```

## 3 - Terraform Apply
`terraform apply -auto-approve`:
```
google_compute_global_address.jenkins_ip: Creating...
google_compute_global_address.jenkins_ip: Still creating... [10s elapsed]
google_compute_global_address.jenkins_ip: Creation complete after 12s [id=projects/prod/global/addresses/global-jenkins-ip]
google_dns_record_set.jenkins_hostname: Creating...
google_dns_record_set.jenkins_hostname: Creation complete after 2s [id=lh-zone/jenkins.lh.cloud./A]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```

## 4 - Check resources after terraform apply
`gcloud dns record-sets list --project=lh --zone=lh-zone`:
```                                                                                                                                                                                           
NAME                                        TYPE  TTL    DATA
jenkins.lh.cloud.            A     300    35.186.255.87
```
 So with the google version 3.63 all is working well.
